//藏干
var 藏干 = { 
    子: { 
        本氣: '癸', 
        餘氣: '',
        雜氣: ''
    }, 
    丑: { 
        本氣: '己', 
        餘氣: '癸',
        雜氣: '辛'
    },     
    寅: { 
        本氣: '甲', 
        餘氣: '戊',
        雜氣: '丙'
    },     
    卯: { 
        本氣: '乙', 
        餘氣: '',
        雜氣: ''
    },     
    辰: { 
        本氣: '戊', 
        餘氣: '乙',
        雜氣: '癸'
    },     
    巳: { 
        本氣: '丙', 
        餘氣: '戊',
        雜氣: '庚'
    },     
    午: { 
        本氣: '丁', 
        餘氣: '',
        雜氣: '己'
    },     
    未: { 
        本氣: '己', 
        餘氣: '丁',
        雜氣: '乙'
    },
    申: { 
        本氣: '庚', 
        餘氣: '戊',
        雜氣: '壬'
    },
    酉: { 
        本氣: '辛', 
        餘氣: '',
        雜氣: ''
    },
    戌: { 
        本氣: '戊', 
        餘氣: '辛',
        雜氣: '丁'
    },
    亥: { 
        本氣: '壬', 
        餘氣: '',
        雜氣: '甲'
    }    
};

var 十神 = {
    甲{
        甲: '比肩',
        乙: '劫財',
        丙: '食神',
        丁: '傷官',
        戊: '偏財',
        己: '正財',
        庚: '七殺',
        辛: '正官',
        壬: '偏印',
        癸: '正印'
    },
    乙{
        甲: '劫財',
        乙: '比肩',
        丙: '傷官',
        丁: '食神',
        戊: '正財',
        己: '偏財',
        庚: '正官',
        辛: '七殺',
        壬: '正印',
        癸: '偏印'
    },
    丙{
        甲: '偏印',
        乙: '正印',
        丙: '比肩',
        丁: '劫財',
        戊: '食神',
        己: '傷官',
        庚: '偏財',
        辛: '正財',
        壬: '七殺',
        癸: '正官'
    },
    丁{
        甲: '正印',
        乙: '偏印',
        丙: '劫財',
        丁: '比肩',
        戊: '傷官',
        己: '食神',
        庚: '正財',
        辛: '偏財',
        壬: '正官',
        癸: '七殺'
    },
    戊{
        甲: '七殺',
        乙: '正官',
        丙: '偏印',
        丁: '正印',
        戊: '比肩',
        己: '劫財',
        庚: '食神',
        辛: '傷官',
        壬: '偏財',
        癸: '正財'
    },
    己{
        甲: '正官',
        乙: '七殺',
        丙: '正印',
        丁: '偏印',
        戊: '劫財',
        己: '比肩',
        庚: '傷官',
        辛: '食神',
        壬: '正財',
        癸: '偏財'
    },
    庚{
        甲: '偏財',
        乙: '正財',
        丙: '七殺',
        丁: '正官',
        戊: '偏印',
        己: '正印',
        庚: '比肩',
        辛: '劫財',
        壬: '食神',
        癸: '傷官'
    },
    辛{
        甲: '正財',
        乙: '偏財',
        丙: '正官',
        丁: '七殺',
        戊: '正印',
        己: '偏印',
        庚: '劫財',
        辛: '比肩',
        壬: '傷官',
        癸: '食神'
    },
    壬{
        甲: '食神',
        乙: '傷官',
        丙: '偏財',
        丁: '正財',
        戊: '七殺',
        己: '正官',
        庚: '偏印',
        辛: '正印',
        壬: '比肩',
        癸: '劫財'
    },
    癸{
        甲: '傷官',
        乙: '食神',
        丙: '正財',
        丁: '偏財',
        戊: '正官',
        己: '七殺',
        庚: '正印',
        辛: '偏印',
        壬: '劫財',
        癸: '比肩'
    },
};

var 十神逆 = {
    甲{
        比肩: '甲',
        劫財: '乙',
        食神: '丙',
        傷官: '丁',
        正財: '己',
        偏財: '戊',
        正官: '辛',
        七殺: '庚',
        正印: '癸',
        偏印: '壬'
    },
    乙{
        比肩: '乙',
        劫財: '甲',
        食神: '丁',
        傷官: '丙',
        正財: '戊',
        偏財: '己',
        正官: '庚',
        七殺: '辛',
        正印: '壬',
        偏印: '癸'
    },
    丙{
        比肩: '丙',
        劫財: '丁',
        食神: '己',
        傷官: '戊',
        正財: '辛',
        偏財: '庚',
        正官: '癸',
        七殺: '壬',
        正印: '乙',
        偏印: '甲'
    },
    丁{
        比肩: '丁',
        劫財: '丙',
        食神: '戊',
        傷官: '己',
        正財: '庚',
        偏財: '辛',
        正官: '壬',
        七殺: '癸',
        正印: '甲',
        偏印: '乙'
    },
    戊{
        比肩: '戊',
        劫財: '己',
        食神: '辛',
        傷官: '庚',
        正財: '癸',
        偏財: '壬',
        正官: '乙',
        七殺: '甲',
        正印: '丁',
        偏印: '丙'
    },
    己{
        比肩: '己',
        劫財: '戊',
        食神: '庚',
        傷官: '辛',
        正財: '壬',
        偏財: '癸',
        正官: '甲',
        七殺: '乙',
        正印: '丙',
        偏印: '丁'
    },
    庚{
        比肩: '庚',
        劫財: '辛',
        食神: '壬',
        傷官: '癸',
        正財: '乙',
        偏財: '甲',
        正官: '丁',
        七殺: '丙',
        正印: '己',
        偏印: '戊'
    },
    辛{
        比肩: '辛',
        劫財: '庚',
        食神: '癸',
        傷官: '壬',
        正財: '甲',
        偏財: '乙',
        正官: '丙',
        七殺: '丁',
        正印: '戊',
        偏印: '己'
    },
    壬{
        比肩: '壬',
        劫財: '癸',
        食神: '甲',
        傷官: '乙',
        正財: '丁',
        偏財: '丙',
        正官: '己',
        七殺: '戊',
        正印: '辛',
        偏印: '庚'
    },
    癸{
        比肩: '癸',
        劫財: '壬',
        食神: '甲',
        傷官: '乙',
        正財: '丙',
        偏財: '丁',
        正官: '戊',
        七殺: '己',
        正印: '庚',
        偏印: '辛'
    }
};


