//藏干
var 藏干 = { 
    子: { 
        本氣: '癸', 
        餘氣: '',
        雜氣: ''
    }, 
    丑: { 
        本氣: '己', 
        餘氣: '癸',
        雜氣: '辛'
    },     
    寅: { 
        本氣: '甲', 
        餘氣: '戊',
        雜氣: '丙'
    },     
    卯: { 
        本氣: '乙', 
        餘氣: '',
        雜氣: ''
    },     
    辰: { 
        本氣: '戊', 
        餘氣: '乙',
        雜氣: '癸'
    },     
    巳: { 
        本氣: '丙', 
        餘氣: '戊',
        雜氣: '庚'
    },     
    午: { 
        本氣: '丁', 
        餘氣: '',
        雜氣: '己'
    },     
    未: { 
        本氣: '己', 
        餘氣: '丁',
        雜氣: '乙'
    },
    申: { 
        本氣: '庚', 
        餘氣: '戊',
        雜氣: '壬'
    },
    酉: { 
        本氣: '辛', 
        餘氣: '',
        雜氣: ''
    },
    戌: { 
        本氣: '戊', 
        餘氣: '辛',
        雜氣: '丁'
    },
    亥: { 
        本氣: '壬', 
        餘氣: '',
        雜氣: '甲'
    },    
};


